unagauchada/app/views/gauchadas/index.html.erb

SELECT `gauchadas`.* FROM `gauchadas`
---

<%= @gauchadas = Gauchada.all