unagauchada/app/controllers/gauchadas_controller.rb

  def index
    @gauchadas = Gauchada.all
---
SELECT `gauchadas`.* FROM `gauchadas` WHERE (title LIKE '%dsdsdsd%') ORDER BY title ASC

  def create
    @gauchada = current_user.gauchadas.new(gauchada_params)

    respond_to do |format|
      if @gauchada.save
---
INSERT INTO `gauchadas` (`nombre`, `title`, `descripcion`, `estado`, `fecha_de_inicio`, `fecha_limite`, `created_at`, `updated_at`, `user_id`) VALUES ('help me', 'Busco acompañante de viaje', 'Soy camionero y busco una persona que me acompañe en mi viaje hasta Rawson porque sufro problemas de sueño. \r\nSaldríamos el primer fin de semana de octubre y retornaríamos el fin de semana siguiente. \r\n', 'deprobado', '2015-03-24', '2017-05-24', '2017-05-24 03:14:22', '2017-05-24 03:14:22', 1)

  def update
    respond_to do |format|
      if @gauchada.update(gauchada_params)
---
UPDATE `gauchadas` SET `descripcion` = 'Ramirez es un burrito que tenía de mascota en un campo en Tucumán. Quisiera reencontrarme con él pero no puedo moverme por un problema físico. \r\nMe gustaría que alguien lo traiga desde mi pueblo para poder saludarlo y luego volver a llevarlo.\r\n*la foto es del 2004, Ramirez puede haber cambiado un pocoRamirez es un burrito que tenía de mascota en un campo en Tucumán. Quisiera reencontrarme con él pero no puedo moverme por un problema físico. \r\nMe gustaría que alguien lo traiga desde mi pueblo para poder saludarlo y luego volver a llevarlo.\r\n*la foto es del 2004, Ramirez puede haber cambiado un poco\r\nRamirez es un burrito que tenía de mascota en un campo en Tucumán. Quisiera reencontrarme con él pero no puedo moverme por un problema físico. \r\nMe gustaría que alguien lo traiga desde mi pueblo para poder saludarlo y luego volver a llevarlo.\r\n*la foto es del 2004, Ramirez puede haber cambiado un poco\r\n', `estado` = 'aprobado', `updated_at` = '2017-05-27 23:17:52' WHERE `gauchadas`.`id` = 3

  def destroy
    @gauchada.destroy
---
DELETE FROM `gauchadas` WHERE `gauchadas`.`id` = 2

    def set_gauchada
      @gauchada = Gauchada.find(params[:id])
---
SELECT  `gauchadas`.* FROM `gauchadas` WHERE `gauchadas`.`id` = 3 LIMIT 1