unagauchada/app/views/index/index.html.erb

SELECT  `gauchadas`.* FROM `gauchadas` ORDER BY `gauchadas`.`id` DESC LIMIT 1
---
<h1>Últimas gauchadas</h1>
  <%= @gauchadas = Gauchada.all